tap "anomalyco/tap"
tap "theboredteam/boring-notch", "https://github.com/TheBoredTeam/homebrew-boring-notch"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
brew "zsh"
# Command-line tool to interact with exercism.io
brew "exercism"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Fast, highly customisable system info script
brew "neofetch"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode", trusted: true
# E-books management software
cask "calibre"
# Multimedia player
cask "vlc"
# Music
cask "spotify"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Web browser
cask "firefox"
cask "google-chrome"
cask "brave-browser"
# Terminal emulator as alternative to Apple's Terminal app
#cask "iterm2"
# Cross-platform terminal emulator
cask "kitty"
# Window manager
cask "loop"
# Non-Apple Mouse Utility - https://github.com/noah-nuebling/mac-mouse-fix
cask "mac-mouse-fix"
# Monitor Control - External Monitor Utility - http://github.com/MonitorControl/MonitorControl
cask "monitorcontrol"
# Open-source code editor
cask "visual-studio-code"

vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bmewburn.vscode-intelephense-client"
vscode "chrmarti.regex"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "ecmel.vscode-html-css"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.hexeditor"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "streetsidesoftware.code-spell-checker"
vscode "takumii.markdowntable"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "yzhang.markdown-all-in-one"
uv "specify-cli"
npm "corepack"

# Fonts: 
## Maple Mono NF https://github.com/subframe7536/maple-font
cask "font-maple-mono-nf"